stresstest.yml
config:
  target: "http://localhost:3003/api"
  phases:
    - duration: 30
      arrivalRate: 1
      name: Warm up
    - duration: 60
      arrivalRate: 1
      rampTo: 10
      name: Ramp up
    - duration: 180
      arrivalRate: 10
      name: Sustained load
scenarios:
  - flow:
    - loop:
      - get:
          url: "/tips/{{ $randomNumber(9000000, 10000000) }}"
          capture:
            json: "$[0].id"
            as: "id"
      - get:
          url: "/articles/{{ id }}"
      - get:
          url: "/features/{{ id }}"
      count: 50